app/serializers/playlist_serializer.rb

  def songs
    object.songs.map do |i|
      @song = Song.find(i.id)
---
SELECT "songs".* FROM "songs" INNER JOIN "playlist_songs" ON "songs"."id" = "playlist_songs"."song_id" WHERE "playlist_songs"."playlist_id" = $1  [["playlist_id", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]