app/serializers/user_serializer.rb

SELECT "user_songs".* FROM "user_songs" WHERE "user_songs"."user_id" = $1  [["user_id", 3]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
  def my_songs
    object.user_songs.map do |i|
      @song = Song.find(i.song_id)
      @album = Album.find(@song.album_id)

SELECT "user_artists".* FROM "user_artists" WHERE "user_artists"."user_id" = $1  [["user_id", 3]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
---
  def my_artists
    object.user_artists.map do |i|
      @artist = Artist.find(i.artist_id)

SELECT "user_albums".* FROM "user_albums" WHERE "user_albums"."user_id" = $1  [["user_id", 3]]
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
---
  def my_albums
    object.user_albums.map do |i|
      @album = Album.find(i.album_id)

SELECT "user_genres".* FROM "user_genres" WHERE "user_genres"."user_id" = $1  [["user_id", 3]]
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def my_genres
    object.user_genres.map do |i|
      @genre = Genre.find(i.genre_id)