app/controllers/artists_controller.rb

  def show
    @artist = Artist.find(params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]