app/controllers/genres_controller.rb

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def show
    @genre = Genre.find(params[:id])